export interface WireData {
  id: string;
  name: string;
  weightPerMeter: number;
}

export const wireDataList: WireData[] = [
  // ลวดเหล็กตีเกลียว
  { id: "1010100002", name: "ลวดเหล็กตีเกลียว 25 ต.มม.", weightPerMeter: 0.1920 },
  { id: "1010100003", name: "ลวดเหล็กตีเกลียว 35 ต.มม.", weightPerMeter: 0.2720 },
  { id: "1010100004", name: "ลวดเหล็กตีเกลียว 50 ต.มม.", weightPerMeter: 0.3920 },
  { id: "1010100006", name: "ลวดเหล็กตีเกลียว 95 ต.มม.", weightPerMeter: 0.7400 },
  // สายทองแดงเปลือย
  { id: "1020000003", name: "สายทองแดงเปลือย 25 ต.มม.", weightPerMeter: 0.2270 },
  { id: "1020000004", name: "สายทองแดงเปลือย 35 ต.มม.", weightPerMeter: 0.3140 },
  { id: "1020000005", name: "สายทองแดงเปลือย 50 ต.มม.", weightPerMeter: 0.4520 },
  { id: "1020000006", name: "สายทองแดงเปลือย 70 ต.มม.", weightPerMeter: 0.6180 },
  // สายอลูมิเนียมเปลือย (AAC)
  { id: "1020010000", name: "สายอลูมิเนียมเปลือย 25 ต.มม. (AAC)", weightPerMeter: 0.0690 },
  { id: "1020010001", name: "สายอลูมิเนียมเปลือย 35 ต.มม. (AAC)", weightPerMeter: 0.0960 },
  { id: "1020010002", name: "สายอลูมิเนียมเปลือย 50 ต.มม. (AAC)", weightPerMeter: 0.1370 },
  { id: "1020010003", name: "สายอลูมิเนียมเปลือย 70 ต.มม. (AAC)", weightPerMeter: 0.1900 },
  { id: "1020010004", name: "สายอลูมิเนียมเปลือย 95 ต.มม. (AAC)", weightPerMeter: 0.2610 },
  // สายอลูมิเนียมแกนเหล็ก (ACSR)
  { id: "1020020001", name: "สายอลูมิเนียมแกนเหล็ก 35 ต.มม. (ACSR)", weightPerMeter: 0.1390 },
  { id: "1020020002", name: "สายอลูมิเนียมแกนเหล็ก 50 ต.มม. (ACSR)", weightPerMeter: 0.1950 },
  { id: "1020020005", name: "สายอลูมิเนียมแกนเหล็ก 120/20 ต.มม. (ACSR)", weightPerMeter: 0.3810 },
  { id: "1020020006", name: "สายอลูมิเนียมแกนเหล็ก 150/25 ต.มม. (ACSR)", weightPerMeter: 0.4910 },
  // สายหุ้มพีวีซี
  { id: "1020070000", name: "สายอลูมิเนียมตีเกลียวหุ้มฉนวน PVC 25 ต.มม.", weightPerMeter: 0.1185 },
  { id: "1020070001", name: "สายอลูมิเนียมตีเกลียวหุ้มฉนวน PVC 35 ต.มม.", weightPerMeter: 0.1542 },
  { id: "1020070002", name: "สายอลูมิเนียมตีเกลียวหุ้มฉนวน PVC 50 ต.มม.", weightPerMeter: 0.2035 },
  { id: "1020070003", name: "สายอลูมิเนียมตีเกลียวหุ้มฉนวน PVC 70 ต.มม.", weightPerMeter: 0.2834 },
  { id: "1020070004", name: "สายอลูมิเนียมตีเกลียวหุ้มฉนวน PVC 95 ต.มม.", weightPerMeter: 0.3699 },
  // เคเบิลอากาศ 22 kV (SAC)
  { id: "1020050000", name: "เคเบิลอากาศ อลูมิเนียม 22 เควี 50 ต.มม. (SAC)", weightPerMeter: 0.4580 },
  { id: "1020050001", name: "เคเบิลอากาศ อลูมิเนียม 22 เควี 95 ต.มม. (SAC)", weightPerMeter: 0.6590 },
  { id: "1020050002", name: "เคเบิลอากาศ อลูมิเนียม 22 เควี 120 ต.มม. (SAC)", weightPerMeter: 0.7615 },
  { id: "1020050004", name: "เคเบิลอากาศ อลูมิเนียม 22 เควี 185 ต.มม. (SAC)", weightPerMeter: 1.0065 },
];
