export const driverTypes = [
  { id: "type2", name: "ชนิดที่ 2", desc: "รถบรรทุกทั่วไป (ไม่ได้ประจำชุดงานก่อสร้าง)", base: 18720, ot15: 117.00, ot10: 78.00, ot30: 234.00, accom: 400 },
  { id: "type2plus", name: "ชนิดที่ 2+", desc: "รถบรรทุกติดเครน (6 ตัน, รถสว่าน)", base: 23820, ot15: 148.88, ot10: 99.25, ot30: 297.75, accom: 400 },
  { id: "type2special", name: "ชนิดที่ 2+พิเศษ", desc: "บังคับเครนพิกัดสูง (25, 30, 35 ตัน/เมตร)", base: 24540, ot15: 153.38, ot10: 102.25, ot30: 306.75, accom: 400 },
  { id: "type3plus", name: "ชนิดที่ 3+", desc: "รถเทรเลอร์ลากจูงติดเครน", base: 27120, ot15: 169.50, ot10: 113.00, ot30: 339.00, accom: 400 }
];

export interface VehicleDriver {
  plate: string;
  desc: string;
  driver: string;
}

export const driversList: VehicleDriver[] = [
  { plate: "84-1643 นฐ", desc: "รถสว่านขุดเจาะ", driver: "ณัฐพล พืชพันธ์" },
  { plate: "86-4715 นฐ", desc: "รถเทรลเลอร์", driver: "ฉลองชัย ปานเรือง" },
  { plate: "90-7312 นฐ", desc: "รถเครนขนาดพิกัด 30ตัน/เมตร", driver: "ขวัญเรือน มีถาวร" },
  { plate: "90-7311 นฐ", desc: "รถเครนขนาดพิกัด 30ตัน/เมตร", driver: "อินทพร สร้อยสังวาลย์" },
  { plate: "90-3515 นฐ", desc: "รถสว่านขุดเจาะ", driver: "อนิวัต จุลมูล" },
  { plate: "90-2235 นฐ", desc: "รถบรรทุก 6 ตัน คิดเครนพับ", driver: "กิตติภัฏ กาฬษร" },
  { plate: "85-3090 นฐ", desc: "รถเทรลเลอร์", driver: "ธวัชชัย โต๊ะศรีสุข" },
  { plate: "90-2230 นฐ", desc: "รถบรรทุก 6 ตัน คิดเครนพับ", driver: "วิสูตร เสือคล้าย" },
  { plate: "90-2952 นฐ", desc: "รถสว่านขุดเจาะ", driver: "วิสูตร เสือคล้าย" },
  { plate: "90-8896 นฐ", desc: "รถเครนขนาดพิกัด 30ตัน/เมตร", driver: "เสนาะ ดาวเรือง" },
  { plate: "90-0423 นฐ", desc: "รถบรรทุก 6 ตัน คิดเครนพับ", driver: "โหนก แก้วบัวดี" },
  { plate: "90-2951 นฐ", desc: "รถสว่านขุดเจาะ", driver: "ไพฑูรย์ สุขสมบัติ" },
  { plate: "90-7310 นฐ", desc: "รถเครนขนาดพิกัด 30ตัน/เมตร", driver: "มานิตย์ ใจชื้น" },
  { plate: "89-5774 นฐ", desc: "รถเครนขนาดพิกัด 25ตัน/เมตร", driver: "อุเทน นามศร" },
  { plate: "84-9636 นฐ", desc: "รถเครนขนาดพิกัด 25ตัน/เมตร", driver: "อุเทน นามศร" },
  { plate: "89-2131 นฐ", desc: "รถบรรทุก 6 ตัน คิดเครนพับ", driver: "พงษ์พันธ์ จุติโรจนปกรณ์" },
  { plate: "89-6967 นฐ", desc: "รถสว่านขุดเจาะ", driver: "ผดุงเกียรติ ศรีใส" },
  { plate: "6ขล-1943 กทม", desc: "รถยนต์กระบะ 2 ตอน", driver: "" },
  { plate: "7ขฆ-663 กทม", desc: "รถยนต์กระบะ 2 ตอน", driver: "" }
];
